from dataclasses import dataclass
from aiogram.types import RichTextCustomEmoji

@dataclass(frozen=True)
class Emoji:
    custom_id: str
    fallback: str

    def html(self) -> str:
        return (
            f'<tg-emoji emoji-id="{self.custom_id}">'
            f"{self.fallback}"
            "</tg-emoji>"
        )

    def rich(self) -> RichTextCustomEmoji:
        return RichTextCustomEmoji(
            custom_emoji_id=self.custom_id,
            alternative_text=self.fallback,
        )



# РЕПЛАЙ КНОПКИ
# SHOP = Emoji("5983399041197675256", "")  # Магазин
# BONUS = Emoji("5364119685451259098", "🎁")  # Бонусная система
# PROFILE = Emoji("5364224864905367463", "")  # Профиль
FEEDBACK = Emoji("6035305550625902723", "")  # Обратная связь
MOON = Emoji("5938342819922973434", "🌙")  # Сегодняшняя запись
SETTINGS = Emoji("5877260593903177342", "⚙️")  # Сегодняшняя запись
STATISTICS = Emoji("5936143551854285132", "")  # Статистика
UPDATE = Emoji("5879841310902324730","✏️")  # Редактирование записи
USERS = Emoji("6032594876506312598", "👥")  # Пользователи
# CART = Emoji("6030822047150512346", "")  # Корзина
# PROMOCODE = Emoji("5881986900469748194", "")  # Промокоды

# ОПИСАНИЯ
ANTISPAM_DESC = Emoji("5251203410396458957", "🛡")  # описание антиспама
# ATTENTION = Emoji("5463312955879727255", "")  # описание ВНИМАНИЕ
# DISCOUNT_DESC = Emoji("5573333417954639880", "")  # сумма бонусного баланса
# BONUS_RECEIVE = Emoji("5359664288241829619", "🎉")  # описание получения бонуса
# BONUS_LIST = Emoji("6030839471832829491", "")  # описание доступных бонусов
BROKEN_HEART = Emoji("5445040416950856638", "💔")  # разбитое сердечко
CANCEL_DESC = Emoji("5399849634350768407", "❌")  # описание отмены действия
CALENDAR_DESC = Emoji("5413879192267805083", "📅")  # календарь анимированный
ERROR = Emoji("5399849634350768407", "⚠️")  # описание ошибка
EX_MARK = Emoji("5393436114306486930", "⚠️")  # анимированный воскл. знак
HI = Emoji("5458904472598095631", "👋")  # приветственное сообщение
HEART = Emoji("5411308619981410664", "❤️")  # сердечко
# LINK = Emoji("6028171274939797252", "🔗")  # Ссылка статичная
# LINK_DESC = Emoji("5271604874419647061", "🔗")  # анимированная цепь
MOON_DESC = Emoji("5422444920424127856", "🌙")  # месяц анимированный
NOT_FOUND = Emoji("5456304325166900944", "⚠️")  # описание того, чего нет:)
# PACK = Emoji("5463172695132745432", "📦")  # описание упаковки
# PAYMENT_SUCCESS = Emoji("5206607081334906820", "ℹ️")  # описание
# SEND_DESC = Emoji("5774022692642492953", "✅")  # описание отправки
SLEEP_DESC = Emoji("5346167851730348282", "😴")  # описание сна
STAR = Emoji("5408869739982246969", "⭐")  # анимированная звезда
SUCCESS = Emoji("5980930633298350051", "✅")  # описание успех
SUNRISE = Emoji("5411199759740325999", "🌙")  # анимированное солнышко с облаком
QUESTION = Emoji("5402254493913993011", "❓")  # анимированный вопрос
WINK = Emoji("5458394638505223612", "😉")  # описание успех


# ИНЛАЙН КНОПКИ
# ADD = Emoji("5775937998948404844", "➕")  # кнопка добавить
# ADD_TO_CART = Emoji("596🌙 Во сколько вы легли спать?3087934696459905", "➕")  # кнопка добавить в корзину
BACK = Emoji("5960671702059848143", "⬅️")  # кнопка возврата на 1 шаг
BELL_OFF = Emoji("6039569594157371705", "🔕") # зачеркнутый колокольчик
BELL_ON = Emoji("6039486778597970865", "🔔") # колокольчик
CANCEL = Emoji("5778527486270770928", "❌")  # кнопка отмены действия
CLOCK = Emoji("5985616167740379273","⏰")  # будильник
# DELETE = Emoji("5879896690210639947","🗑")  # кнопка удалить
EARTH = Emoji("5361630446960549752", "🌍")  # планета
# FOLLOW = Emoji("5372917041193828849", "")  # кнопка Перейти 
INPUT = Emoji("5877396173135811032", "⌨️")  # кнопка ввода(клавиатура)
# MINUS = Emoji("5782743443348394021", "➕")  # плюсик
MOSCOW = Emoji("5370721363717806448", "")  # Москва анимированная
# ORDER = Emoji("5884479287171485878", "📦")  # кнопка конкретного заказа
# ORDERS = Emoji("5778311685638984859", "📦")  # кнопка История заказов
# PLUS = Emoji("5274008024585871702", "➖")  # минусик
# SEARCH = Emoji("6032850693348399258", "🔍")  # кнопка поиска
# SEND = Emoji("5774022692642492953", "✅")  # кнопка отправки
# SUBSCRIBE = Emoji("5920090136627908485", "➕")  # кнопка Подписаться
TGSTAR = Emoji("5956148757899776734", "⭐")  # тг-звезда

# ПРОЧЕЕ
# CONTACT = Emoji("6037418554276452311", "📱")  # кнопка отправки контакта
ONE_TGSTAR = Emoji("5462973284096187141", "⭐")  # одна тг-звезда
TWO_TGSTAR = Emoji("5463144039110974785", "⭐")  # две тг-звезды
THREE_TGSTAR = Emoji("5465465082387405590", "⭐")  # три тг-звезды
MEGA_TGSTAR = Emoji("5465535055994588075", "⭐")  # тг-звезда другого цвета
